/*Со помош на знаците ‘@’,'%', и ‘.‘ се формира квадратна слика со „должина“ m (m>2) која претставува квадрат од знаците '.',
впишан во квадрат од знаците @ и %(види примери). За внесено m да се испечати на екран соодветната слика. Внимавајте – не печатете нити еден дополнителен знак,
како празно место, непотребен знак за нов ред... Сликата завршува со знак за нов ред. Забелешка: Бидејќи е дадено ограничување за m, во точно решение на задачата 
не треба да се користи низа/матрица.*/

//TEST CASE 1
//INPUT 11
/*OUTPUT %@@@@@@@@@%
         %.........%
         %.........%
         %.........%
         %.........%
         %.........%
         %.........%
         %.........%
         %.........%
         %.........%
         %@@@@@@@@@% */


//CODE

#include <iostream>
using namespace std;
int main(){
    int m,i;
    cin>>m;

    cout<<"%";
    for(i=0;i<m-2;i++){
        cout<<"@";
    }
    cout<<"%"<<endl;

    for(i=0;i<m-2;i++){
        cout<<"%";
        for(int j=0;j<m-2;j++){
            cout<<".";
        }
        cout<<"%"<<endl;
    }

    cout<<"%";
    for(i=0;i<m-2;i++){
        cout<<"@";
    }
    cout<<"%"<<endl;
}

