/*Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата). Притоа самиот елемент кој ја дели матрицата припаѓа во четвртиот 
квадрант (-5 во примерот на сликата). Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100). Потоа се внесуваат два броеви кои
претставуваат индекси на еден елемент од матрицата. Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез. Притоа се печати 
сумата за првиот квадрант, па за вториот, па третиот и на крај за четвртиот. Доколку не може да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0.*/

//Види слика во "PICTURES"

#include <iostream>
#include <cstring>
using namespace std;
int main(){
    int mat[100][100];
    int n,m,ii,ij;
    cin>>n>>m;
    for(int i=0;i<n;i++){
        for(int j=0;j<m;j++){
            cin>>mat[i][j];
        }
    }
    cin>>ii>>ij;
    int sum1=0,sum2=0,sum3=0,sum4=0;
    for(int i=0;i<n;i++){
        for(int j=0;j<m;j++){
            if(i<ii && j>=ij){
                sum1=sum1+mat[i][j];
            }
            if(i<ii && j<ij){
                sum2=sum2+mat[i][j];
            }
            if(i>=ii && j<ij){
                sum3=sum3+mat[i][j];
            }
            if(i>=ii && j>=ij){
                sum4=sum4+mat[i][j];
            }
        }
    }
    cout<<sum1<<" "<<sum2<<" "<<sum3<<" "<<sum4;
}
