/*Oд стандарден влез се вчитува еден цел број X, димензии на матрица M и N (цели броеви), како и елементите на матрицата со димензии M x N (цели броеви). 
Да се напише програма што ќе ги промени редиците на матрицата на следниот начин:
Ако збирот на елементите од редот е поголем од X, елементите на тој ред добиваат вредност 1
Ако збирот на елементите од редот е помал од X, елементите на тој ред добиваат вредност -1
Ако збирот на елементите од редот е еднаков на X, елементите на тој ред добиваат вредност 0
Променетата матрица да се испечати на екран.*/



#include<iostream>
using namespace std;
int main(){
    int i,j,m,n,x,a[100][100],sum=0;
    cin>>x;
    cin>>m>>n;
    for(i=0;i<m;i++){
        for(j=0;j<n;j++){
            cin>>a[i][j];
        }
    }
    for(i=0;i<m;i++){
        sum=0;
        for(j=0;j<n;j++){
        sum=sum+a[i][j];
        }
        if(sum>x){
            for(j=0;j<n;j++){
                a[i][j]=1;
                
            }
        }
        if(sum<x){
            for(j=0;j<n;j++){
                a[i][j]=-1;
                
            }
        }
        if(sum==x){
            for(j=0;j<n;j++){
                a[i][j]=0;
                
            }
        }
        
        
        for(j=0;j<n;j++){
            cout<<a[i][j]<<" ";
        }
        
        cout<<endl;
        
    }
    
}
