/*Од тастатура се внесуваат димензиите m и n на матрица од цели броеви, Аmxn, ( 0 < m, n < 30 ) и нејзините елементи. Потоа се внесуваат два цели броја r и k 
(индекси на редица/колона од матрицата, т.е. 0 <= r < m и 0 <= k < n). Да се напише програма која ja трансформира матрицата А така што елементите над редицата r 
и лево од колоната k се заменуваат со минималната вредност од матрицата А.
Пример
Влез
4 6 // m и n
2 3 // r и k
1 2 3 4 5 1             
2 9 4 5 1 3
4 5 6 7 3 2
1 2 3 3 2 8
Излез 
1 1 1 4 5 1   
1 1 1 5 1 3
4 5 6 7 3 2
1 2 3 3 2 8*/



#include <iostream>
using namespace std;
int main(){
    int m,n,r,k,i,j,mat[100][100];
    cin>>m>>n;
    cin>>r>>k;
    for(i=0;i<m;i++){
        for(j=0;j<n;j++){
            cin>>mat[i][j];
        }
    }
    int min=mat[0][0];
    for(i=0;i<m;i++){
        for(j=0;j<n;j++){
            if(min>mat[i][j]){
                min=mat[i][j];
            }
        }
    }
    for(i=0;i<m;i++){
        for(j=0;j<n;j++){
            if(i<r && j<k){
                mat[i][j]=min;
            }
        }
    }
    for(i=0;i<m;i++){
        for(j=0;j<n;j++){
            cout<<mat[i][j]<<" ";
        }
        cout<<endl;
    }
}
