/*Од стандарден влез се внесуваат непознат број на реченици претставени преку текстуални низи (стрингови) секоја не подолга од 100 знаци и секоја во нов ред.
Програмата треба да го најде стрингот кој содржи најмногу сврзници и да го испечати заедно со бројот на најдените сврзници. За сврзници се сметаат сите зборови
составени од една, две или три букви. Зборовите во текстуалната низа се одделени со едно или повеќе прзани места и/или интерпункциски знак. Броењето на сврзници
во дадена текстуална низа треба да се реализира во посебна функција. Ако има повеќе реченици со ист максимален број на сврзници, се печати прво најдената.
Објаснување на тест примерот:
Бројот на сврзници по реченици е 2, 3, 4, 2, 4 и 7 соодветно. Најмногу сврзници има по последната реченица па се печати бројот 7 и содржината на таа реченица.*/



#include <iostream>
#include <cstring>
using namespace std;
int svrznik(char a[]){
    int x=0;
    int svrznici=0;
    for (int i = 0; i < strlen(a); ++i) {
        if (isalpha(a[i])){
            x++;
        }
        if (!isalpha(a[i])){
            if (x>0 && x<=3) {
                svrznici++;
            }
                x=0;
        }
    }
    return svrznici;
}
int main() {
    char a[100],maks[100];
    int svrznici,svrznicimaks;
    
    cin.getline(a,100);
    svrznicimaks= svrznik(a);
    strcpy(maks,a);
    
    while (cin.getline(a,100)){
        svrznici= svrznik(a);
        if (svrznicimaks<svrznici){
            svrznicimaks=svrznici;
            strcpy(maks,a);
        }
    }
    cout<<svrznicimaks<<": "<<maks<<endl;

    return 0;
}
