/*Од стандарден влез се читаат елементите на една матрица (A), составена од цели броеви. Прво се читаат бројот на редици N и бројот на колони M на
матрицата (N, M < 120), а потоа и самите елементи на матрицата. Да се испечати колку индексни броеви има во секоја колона поединечно.
Индексен број е број чија вредност е идентична со вредноста што се добива со спојување на индексот од редицата и колоната на елементот.
Помош:
Индексен елемент: вредноста на елементот Aij е иста со ij како број
- ако i=10, j=31, елементот Aij треба да има вредност 1031 за да биде индексен број
Пример:
Влез:
4  5
0    1    2    3    4
5    6    7    8    9
10  21  22  23  11
0    1    2    33    4
Излез:
1
2
2
3
1
Објаснување:
Во матрицата A индексни елементи се: 
1ва колона: 0
2ра колона: 1, 21
3та колона: 2, 22
4та колона: 3, 23, 33
5та колона: 4*/




#include <iostream>
using namespace std;
int main() {
    int n,m;
    cin>>n>>m;
    int a[n][m],b[m];
    int counter=0;
    for (int i = 0; i < n; ++i) {
        for (int j = 0; j < m; ++j) {
            cin>>a[i][j];
        }
    }
    for (int i = 0; i < m; ++i) {
        for (int j = 0; j < n; ++j) {
            int pro=j;
            if (i<10){
                pro=pro*10+i;
            }
            if (i>=10 && i<100){
                pro=pro*100+i;
            }
            if (i>=99){
                pro=pro*1000+i;
            }

            if (pro==a[j][i]){
                counter++;
            }
        }
        b[i]=counter;
        counter=0;
    }
    for (int i = 0; i < m; ++i) {
        cout<<b[i]<<endl;
    }
    return 0;
}
