/*Од тастатура се внесува цел број M, а потоа M низи од цели броеви. За секоја низа прво се внесува бројот на елементи во низата N (N<=100), 
а потоа и елементите на низата. Секоја од внесените низи треба да се трансформира според следново правило:
Ако првиот елемент од низата е позитивен број, тоа значи сите елементи од низата (вклучувајќи го и првиот) да се поместат за онолку места во десно,
колку што е вредноста на елементот, празнините што ќе настанат во низата да се пополнат со елементи со вредност нула.
Ако првиот елемент од низата е негативен број, тоа значи сите елементи од низата (вклучувајќи го и првиот) да се поместат за онолку места во лево, 
колку што е вредноста на елементот, празнините што ќе настанат во низата да се пополнат со елементи со вредност нула.
При поместување на елементите, бројот на елементите во низата останува непроменет.
На крајот да се испечатат трансформираните низи како и тоа колку од влезните низи останале празни, односно по трансформацијата имаат само елементи со вредност нула.
Трансформацијата на низите да се реализира во посебна функција.
Објаснување на вториот и третиот пример:
Во вториот пример се вчитува само една низа со 5 елементи (1,2,3,4,5). Првиот елемент е 1 (позитивен број), па елементите се поместуваат за една позиција
на десно (_,1,2,3,4). Потоа празнините се пополнуваат со 0 и низата ги има елементите 0,1,2,3,4.
Во третиот пример се вчитува исто само една низа со 5 елементи (-2,-3,-4,-5,-6). Првиот елемент е -2 (негативен број), па елементите се поместуваат за две позиции 
на лево (-4,-5,-6,_,__). Потоа празнините се пополнуваат со 0 и низата ги има елементите -4,-5,-6,0,0.*/


#include <iostream>
#include <cmath>
using namespace std;

void nullNiza(int *array, int size){
    for(int i = 0; i<size;i++)
        array[i]=0;
}
void printArray(int *array, int size){
    for(int i = 0; i<size; i++)
        cout<<array[i]<<" ";
    cout<<endl;
}
void pomestiDesno(int *array, int size, int element){
    int i;
    for(int i = size-1; i>=element; i--)
        array[i]=array[i-element];
    for(i = 0; i<element; i++)
        array[i]=0;
}
void pomestiLevo(int *array, int size, int element){
    int i;
    for(i = 0; i<=size-element; i++)
        array[i]=array[i+element];
    for(i=size-element; i<size; i++)
        array[i]=0;
}
int transform(int *array, int size){
    int firstElement = array[0];
    if(abs(firstElement)>=size){
        nullNiza(array, size);
        return 1;
    }
    if(firstElement>=0)
        pomestiDesno(array, size, firstElement);
    else
        pomestiLevo(array, size, abs(firstElement));
    return 0;
}
int main() {
    int m, n;
    cin>>m;
    int arr[100];
    int nizaSoNuli=0;
    while(m){
        m--;
        cin>>n;
        for(int j=0;j<n;j++){
            cin>>arr[j];
        }
        nizaSoNuli+= transform(arr, n);
        printArray(arr, n);
    }
    cout<<nizaSoNuli;
}
