/*Да се напише програма во C++ која  прима три цели едноцифрени броеви од стандардниот влез, каде (a,b,c > 0 && a,b,c < 10). Вашата задача е да ги комбинирате 
овие броеви за да генерирате еден нов троцифрен број. Напомена: Комбинирањето на броевите да се изврши математички. Дополнително: Дополнително, потребно е во нов ред да 
се испeчати разликата на секој од внесените броеви и генерираниот број.*/

#include <iostream>
using namespace std;

int main() {
    int a, b, c;
    cin>>a>>b>>c;
    int novBroj = a * 100 + b * 10 + c;
    cout<<novBroj<<endl;
    cout<<abs(a - novBroj)<<" ";
    cout<<abs(b - novBroj)<<" ";
    cout<<abs(c - novBroj);
    return 0;
}
