/*Да се напише програма за калкулатор за цена на билети за кино. Цената на билетот зависи од категоријата на филмот и возраста на купувачот.
Пресметките за цена на билет се следни:
За филмови кои спаѓаат во категорија 1, цената на билетот е 8 долари за сите возрасти.
За филмови кои спаѓаат во категорија 2, цената на билетот е 8 долари за клиенти под 12 години и 12 долари за корисници на 12 години и постари.
За филмови кои спаѓаат во категорија 3, цената на билетот е 10 долари за клиенти помлади од 12 години и 15 долари за клиенти од 12 години и постари.
За филмови кои спаѓаат во категорија 4, цената на билетот е 15 долари за клиенти под 17 години и 18 долари за корисници на 17 години и постари.
Од стандарден влез се читаат категорија на филмот и возраст на купувачот. Да се испечати цената на билетот.*/

#include <iostream>
using namespace std;

int main() {
    double ticketPrice;
    int category, age;
    cin >> category>>age;

    if (category == 1) {
        ticketPrice = 8; 
    } else if (category == 2) {
        if (age < 12) {
            ticketPrice = 8; 
        } else {
            ticketPrice = 12; 
        }
    } else if (category == 3) {
        if (age < 12) {
            ticketPrice = 10; 
        } else {
            ticketPrice = 15; 
        }
    } else if (category == 4) {
        if (age < 17) {
            ticketPrice = 15; 
        } else {
            ticketPrice = 18; 
        }
    }
    cout <<"Price: "<< ticketPrice <<"$"<< endl;

    return 0;
}
