#include <iostream>
using namespace std;
/*Од стандарден влез се читаат соодветно низа со M елементи и низа со N елементи, ваша задача е да ги споите двете низи во трета сортирана низа по растечки редослед. 
Објаснување: Се внесува најпрвин должината на првата низа М, па потоа се чита првата низа, потоа се внесува должината на втората низа N, па втората низа.
Напомена: Елементите во двете низи кои се внесуваат се сортирани. Максималната должина на низите е 100.*/

int main(){
    int m,n,arrM[100],arrN[100],k[200];
    cin>>m;
    for(int i=0;i<m;i++){
        cin >> arrM[i];
    }
    cin>>n;
    for(int i=0;i<n;i++){
        cin >> arrN[i];
    }

    for(int i=0;i<m;i++){
        k[i] = arrM[i];
    }
    for (int i = m, j=0; i < n + m; i++,j++) {
        k[i] = arrN[j];
    }
    
    for(int i=0;i<m+n-1;i++){
        for(int j=0;j<m+n-1-i;j++){
            if(k[j] > k[j + 1]){
                swap(k[j], k[j + 1]);
            }
        }
    }
    for(int i=0;i<m+n;i++){
        cout << k[i] << " ";
    }
}
