/*Од стандарден влез да се вчита број N и потоа да се вчитаат N елементи во една низа. Трансформирајте ја низата со удвојување на секој елемент и замена 
на секој негативен елемент со неговата апсолутна вредност. Трансформираната низа да се испечати на стандарден излез, така што елементите ќе се одвоени со 
празно место меѓу нив.*/

#include <iostream>
using namespace std;

int main() {
    int n, niza[100];
    cin >> n;
    for (int i = 0; i < n; i++) {
        cin >> niza[i];
    }
    for (int i = 0; i < n; i++) {
        niza[i] *= 2; 
        if (niza[i] < 0) {
            niza[i] = -niza[i];
        }
    }
    for (int i = 0; i < n; i++) {
        cout << niza[i]<<" ";
    }
    cout << endl;
    return 0;
}
