/*Од стандарден влез се вчитува n (колку броја треба да има во низата), а потоа се внесуваат  секој од елементите на низата. На излез корисникот треба да отпечати
секој елемент кој после него има најмалку два поголеми елементи. 
Пример: n=5, niza=[3,10,16,20,1]
корисникот на излез треба да отпечати: 3 10, бидејќи 3 има 3 поголеми вредности, 10 има 2 поголеми вредности, но не и 16, бидејќи 16 има само една поголема вредност.*/

#include <iostream>
using namespace std;

int main() {
    int n, arr[100];
    cin >> n;
    for (int i = 0; i < n; i++) {
        cin >> arr[i];
    }
    for (int i = 0; i < n; i++) {
        int count = 0;
        for (int j = i + 1; j < n; j++) {
            if (arr[j] > arr[i]) {
                count++;
            }
        }
        if (count >= 2) {
            cout << arr[i] << " ";
        }
    }
    cout << endl;
    return 0;
}
